app/Controllers/Home.php

    public function project()
    {
        // Ambil data proyek dari database
        $projectModel = new ProjectModel();
        $projects = $projectModel->findAll(); // Ubah ini sesuai dengan kebutuhan Anda
---
SELECT *
FROM `project`

    public function buatproject()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'projectName' => 'required',
            'category' => 'required',
            'description' => 'required',
            'startDate' => 'required',
            'deadline' => 'required',
            'budget' => 'required',
            'payment' => 'required'
        ]);

        if ($validation->withRequest($this->request)->run()) {
            // Extract numeric value from the formatted input
            $budget = $this->extractNumericValue($this->request->getPost('budget'));

            $data = [
                'projectName' => $this->request->getPost('projectName'),
                'category' => $this->request->getPost('category'),
                'description' => $this->request->getPost('description'),
                'startDate' => $this->request->getPost('startDate'),
                'deadline' => $this->request->getPost('deadline'),
                'budget' => $budget, // Use the extracted numeric value
                'payment' => $this->request->getPost('payment')
            ];

            $projectModel = new ProjectModel();
            $projectModel->insert($data);
---
INSERT INTO `project` (`projectName`, `category`, `description`, `startDate`, `deadline`, `budget`, `payment`) VALUES ('App Mobile', 'programmer', 'Buatkan Saya App Mobile Memakai Flutter', '2024-01-23', '2024-03-20', 5000000, 'bank')