app/Models/ForumModel.php

    public function insertForum($data)
    {
        return $this->insert($data);
---
INSERT INTO `forum` (`nama`, `pesan`) VALUES ('aditya', 'halo saya suka tokisaki kurumi')

    public function getAllMessages()
    {
        return $this->orderBy('id', 'DESC')->findAll(); // Mengambil semua pesan dari tabel forum dan diurutkan berdasarkan ID dari besar ke kecil
---
SELECT *
FROM `forum`
ORDER BY `id` DESC